#include <stdio.h>
#include <stdlib.h>
#include "list.h"


/*-----操作関数-----*/

/*---------------------------------------
［機 能］空リストを取得する
［引 数］なし
［戻り値］空リストのポインタ
---------------------------------------*/
List *getEmptyList(void){
  // 空のセルとしてNULLポインタをListのポインタにキャストして返す
  return ((List *) NULL);
}

/*---------------------------------------
［機 能］新しいセルを1つ作る
［引 数］data: セルへ格納する整数データ
［　 　］next: 次のセルを指すポインタ
［戻り値］正しく作れた: 作ったセルを指すポインタ
［     ］失敗した　 : 空リスト
---------------------------------------*/
Cell *createCell(int data, List *next){
  Cell *p;
  // もし動的メモリ確保に成功したとき
  if((p = (Cell *)malloc(sizeof(Cell))) != NULL){
    setCellData(p, data);
    setNextCell(p, next);
    return (p);
  }else{
    return (getEmptyList());
  }
}

/*---------------------------------------
［機 能］指定したセルにデータを格納する
［引 数］cell: 操作対象となるセルを指すポインタ
［　 　］next: セルへ格納する整数データ
［戻り値］なし
---------------------------------------*/
void setCellData(Cell *cell, int data){
  cell->data = data;
  return;
}

/*---------------------------------------
［機 能］指定したセルのデータを取り出す
［引 数］cell: 操作対象となるセルを指すポインタ
［戻り値］取り出した整数データ
---------------------------------------*/
int  getCellData(Cell *cell){
  return (cell->data);
}

/*---------------------------------------
［機 能］指定したセルに次のセルのポインタを格納する
［引 数］cell: 操作対象となるセルを指すポインタ
［　 　］next: 次のセルを指すポインタ
［戻り値］なし
---------------------------------------*/
void setNextCell(Cell *cell, List *next){
  cell->next = next;
  return;
}

/*---------------------------------------
［機 能］指定したセルにつながる次のセルのポインタを取り出す
［引 数］cell: 操作対象となるセルを指すポインタ
［戻り値］次のセルを指すポインタ
---------------------------------------*/
List *getNextCell(Cell *cell){
  return (cell->next);
}

/*---------------------------------------
［機 能］与えられたリストが空リストかどうか調べる
［引 数］head: リストの先頭セルを指すポインタ
［戻り値］headが空リストの時:1
［　 　］headが空リストでないとき:0
---------------------------------------*/
int  isEmptyList(List *head){
  
}

/*---------------------------------------
［機 能］新しいセルを1つリストの先頭に追加する
［引 数］head: リストの先頭ポインタを格納している変数のアドレス
［　 　］data: 追加するセルに格納するデータ
［戻り値］追加できたとき:1
［　 　］失敗したとき:0
---------------------------------------*/
int  insertHead(List **head, int data);

/*---------------------------------------
［機 能］リストの先頭セルを削除する
［引 数］head: リストの先頭ポインタを格納している変数のアドレス
［戻り値］削除できたとき:1
［　 　］失敗したとき:0
---------------------------------------*/
int  removeHead(List **head);

/*---------------------------------------
［機 能］リストに格納されているデータを先頭から順に表示する
［引 数］head: リストの先頭セルを指すポインタ
［戻り値］なし
---------------------------------------*/
void printList(List *head);