#include <stdio.h>
#include "list.h"
#include <stdlib.h>

/*-----操作関数-----*/

//------------------------------------------------------------------------
// ① 空リストを取得する
//  ［引　数］なし
//  ［戻り値］空リストへのポインタ
//------------------------------------------------------------------------
List *getEmptyList(void){
  // 空のリストとしてNULLポインタをListのポインタにキャストして返す
  return ((List *) NULL);
}

//------------------------------------------------------------------------
// ② 新しいセルを１つ作る
//  ［引　数］data : セルへ格納する整数データ
//            next : 次のセルへのポインタ
//  ［戻り値］セルを正しく作れたとき：作ったセルを指すポインタ
//　　　　　　セルを作れなかったとき：空リスト
//------------------------------------------------------------------------
Cell *createCell(int data, List *next){
  Cell *p;
  // もし動的メモリ確保に成功したとき
  if((p = (Cell *)malloc(sizeof(Cell))) != NULL){
    setCellData(p, data); // Cellのデータをset
    setNextCell(p, next); // 次のCellのポインタをset
    return (p); // 作ったセルを指すポインタ
  }else{
    return (getEmptyList());  // 空リスト
  }
}

//------------------------------------------------------------------------
// ③ 指定したセルにデータを格納する(既存のデータを更新する)
//  ［引　数］cell : 操作対象となるセルへのポインタ
//            data : セルへ格納する整数データ
//  ［戻り値］なし
//------------------------------------------------------------------------
void setCellData(Cell *cell, int data){
  cell->data = data;
  return;
}

//------------------------------------------------------------------------
// ④ 指定したセルのデータを取り出す
//  ［引　数］cell : 操作対象となるセルへのポインタ
//  ［戻り値］取り出した整数データ
//------------------------------------------------------------------------
int getCellData(Cell *cell){
  return (cell->data);
}

//------------------------------------------------------------------------
// ⑤ 指定したセルに次のセルのポインタを格納する
//  ［引　数］cell : 操作対象となるセルへのポインタ
//            next : 次のセルへのポインタ
//  ［戻り値］なし
//------------------------------------------------------------------------
void setNextCell(Cell *cell, List *next){
  cell->next = next;
  return;
}

//------------------------------------------------------------------------
// ⑥ 指定したセルにつながる次のセルのポインタを取り出す
//  ［引　数］cell : 操作対象となるセルへのポインタ
//  ［戻り値］次のセルへのポインタ
//------------------------------------------------------------------------
List *getNextCell(Cell *cell){
  return (cell->next);
}

//------------------------------------------------------------------------
// ⑦ 与えられたリストが空リストかどうか調べる
//  ［引　数］head : リストの先頭へのポインタ
//  ［戻り値］headが空リストのとき：１、headが空リストでないとき：０
//------------------------------------------------------------------------
int isEmptyList(List *head){
  if(head == getEmptyList()){ // リストが空リストなら
    return (1);
  }else{
    return (0);
  }
}

//------------------------------------------------------------------------
// ⑧ 新しいセルをリストの先頭へ挿入する
//  ［引　数］head : リストの先頭アドレスを格納している変数へのポインタ
//            data : リストの先頭へ挿入するセルの整数値データ
//  ［戻り値］追加に成功したとき：１、失敗したとき：０（元のリストは不変）
//------------------------------------------------------------------------
int insertHead(List **head, int data){
  Cell *p = createCell(data, *head);
  if(p == getEmptyList()){  // 失敗したとき
    return (0);
  }
  *head = p;      // headを新しいセルのポインタに更新

  return (1);
}

//------------------------------------------------------------------------
// ⑨ リストの先頭セルを削除する
//  ［引　数］head : リストの先頭アドレスを格納している変数へのポインタ
//  ［戻り値］正しく削除できたとき：１
//            空リストから削除しようとしたとき：０
//------------------------------------------------------------------------
int removeHead(List **head){
  if(isEmptyList(*head)){   // 空リストの場合は削除不可能
    return (0);
  }
  List *newhead = getNextCell(*head);
  free(*head);      // セルの動的メモリ確保のメモリを解放
  *head = newhead;  // headに次のセルのポインタを代入

  return (1);
}

//------------------------------------------------------------------------
// ⑩ リスト内のデータを先頭から順に表示する
//  ［引　数］head : リストの先頭セルへのポインタ（リストの先頭アドレス）
//                  （注：リストの先頭セルは変更されない）
//  ［戻り値］なし
//------------------------------------------------------------------------
void printList(List *head){
  List* a = head;       // 表示するセルのポインタ
  int CellData;         // 表示するセルのデータ

  while(!isEmptyList(a)){   // セルのポインタが空になるまで
    CellData = getCellData(a);
    printf("%d", CellData);   // セルデータの表示

    a = getNextCell(a); // 次のセルのポインタ
    if(!isEmptyList(a)){
      printf(" -> ");
    }
  }
  return;
}

//------------------------------------------------------------------------
// 問27(2-a) 次のセルのポインタを保持しているメンバ変数のアドレスを取得する
//  ［引　数］cell : 操作対象となるセルへのポインタ
//  ［戻り値］次のセルへのポインタを保持しているメンバ変数を指すポインタ
//------------------------------------------------------------------------
List **getNextCellHead(Cell *cell){
  return(&(cell->next));  // Cellのnextのアドレスを返す
}

//------------------------------------------------------------------------
// 問27(2-b) データが先頭から昇順になるようにセルを追加
//  ［引　数］head : リストの先頭アドレスを格納している変数へのポインタ
//            data : 新たに挿入するセルの整数値データ
//  ［戻り値］追加に成功したとき：１、失敗したとき：０（元のリストは不変）
//------------------------------------------------------------------------
int  insertUpOrder(List **head, int data){
  List **p = head;  // セルへのポインタを格納しているアドレス

  // 追加するデータと既存のセルのデータを比較し、昇順に挿入する
  while(*p != getEmptyList() && getCellData(*p) < data){
    p = getNextCellHead(*p);
  }
  
  return (insertHead(p, data));
}

//------------------------------------------------------------------------
// 問27(3) リストの最後尾セルを削除
//  ［引　数］head : リストの先頭アドレスを格納している変数へのポインタ
//  ［戻り値］正しく削除できたとき：１
//            空リストから削除しようとしたとき：０
//------------------------------------------------------------------------
int removeTail(List **head){
  List **p = head;
  if(*p == getEmptyList()){  // リストが空リストのとき
    return (0);
  }
  while(*getNextCellHead(*p) != getEmptyList()){
    p = getNextCellHead(*p);
  }
  
  // 最後尾のセルを指定して削除
  return (removeHead(p));
}

//------------------------------------------------------------------------
// 問27(4) リストを完全に削除し、空リストにする
//  ［引　数］head : リストの先頭アドレスを格納している変数を指すポインタ
//  ［戻り値］なし
//------------------------------------------------------------------------
void removeList(List **head){
  while(removeHead(head));
  return;
}