#include <stdio.h>
#include <stdlib.h>
#include "list.h"
#include "stack27.h"

/*-----操作関数-----*/

/*---------------------------------------
［機 能］     スタックを初期化し、空の状態にする
［引 数］s ： 初期化するスタック
---------------------------------------*/
void initStack(Stack *s){
  *s = getEmptyList();
  return;
}

/*---------------------------------------
［機 能］スタックにデータを格納する
［引 数］s    ： データの格納対象となるスタック
［　 　］data ： スタックｓへ格納するデータ
［戻り値］正常終了＝１，スタック・オーバーフロー＝０
---------------------------------------*/
int push(Stack *s, int data){
  return (insertHead(s, data));
}

/*---------------------------------------
［機 能］スタックからデータを取り出す
［引 数］s    ： データの取り出し対象となるスタック
［　 　］data ： スタックｓから取り出したデータ
［戻り値］正常終了＝１，スタック・アンダーフロー＝０
---------------------------------------*/
int pop(Stack *s, int *data){
  if(isEmptyList(*s)){
    return (0);
  }
  *data = getCellData(*s);
  return (removeHead(s));
}

/*---------------------------------------
［機 能］スタックを解放する
［引 数］s    ： 解法対象のスタック
［戻り値］なし
---------------------------------------*/  
void freeStack(Stack *s){
  removeList(s);
}