/********************************************
 *  例(2)-1                                 *
 *                                          *
 *  ファイル名：rei2-1.c                    *
 *                                          *
 *  作者　　　：浜工 太郎                   *
 *                                          *
 *  作成日　　：1993.12.25                  *
 *                                          *
 *  説明　　　：簡単なプログラムの例        *
 *              プログラムを実行すると      *
 *              メッセージが表示される      *
 ********************************************/

#include <stdio.h>
main()
{
  printf("Hello world.\n"); //  世界へ向けて挨拶する

  return(0);
}
